Test

```

stdout<<ghadelimiter_30051cc3-972d-41db-af42-1f4bfdeaa3ff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.backup_file will be created
  + resource "local_file" "backup_file" {
      + content              = "very nice"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./config.yml"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

ghadelimiter_30051cc3-972d-41db-af42-1f4bfdeaa3ff
stderr<<ghadelimiter_c82e69cf-9ab9-4e43-9e68-f18cffdecf52

ghadelimiter_c82e69cf-9ab9-4e43-9e68-f18cffdecf52
exitcode<<ghadelimiter_90f697dc-74a6-4895-a132-2eefb41dbfb2
0
ghadelimiter_90f697dc-74a6-4895-a132-2eefb41dbfb2
Plan: 1 to add, 0 to change, 0 to destroy.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # local_file.backup_file will be created%0A  + resource "local_file" "backup_file" {%0A      + content              = "very nice"%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "./config.yml"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
```
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Security 🛡️ `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```
</details>

#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/7dad2dce-f0ec-495e-9d4d-680de4a9c24d/terraform-bin plan -no-color -out tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.backup_file will be created
  + resource "local_file" "backup_file" {
      + content              = "very nice"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./config.yml"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # local_file.backup_file will be created%0A  + resource "local_file" "backup_file" {%0A      + content              = "very nice"%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "./config.yml"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0
stdout<<ghadelimiter_2c984fd0-f47a-4f36-8546-592bc2325444

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.backup_file will be created
  + resource "local_file" "backup_file" {
      + content              = "very nice"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./config.yml"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

ghadelimiter_2c984fd0-f47a-4f36-8546-592bc2325444
stderr<<ghadelimiter_4fdfeff6-5b64-471a-8cbb-69589797f3e4

ghadelimiter_4fdfeff6-5b64-471a-8cbb-69589797f3e4
exitcode<<ghadelimiter_ee807f5d-41ac-45d7-8bbb-2267004bd3df
0
ghadelimiter_ee807f5d-41ac-45d7-8bbb-2267004bd3df
```
</details>

*Pusher: @dawidmalina, Action: `pull_request`, Working Directory: `gcp/prod/global`, Workflow: `Terraform`*